espressif/esp-idf/components/soc/esp32s3/include/soc/ledc_reg.h
// Copyright 2017-2020 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#pragma once

#ifdef __cplusplus
extern "C" {
#endif

#include "soc.h"

#define LEDC_LSCH0_CONF0_REG (DR_REG_LEDC_BASE + 0x0000)
/* LEDC_OVF_CNT_RESET_ST_LSCH0 : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_RESET_ST_LSCH0 (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_LSCH0_M (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_LSCH0_V 0x1
#define LEDC_OVF_CNT_RESET_ST_LSCH0_S 17
/* LEDC_OVF_CNT_RESET_LSCH0 : WO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_RESET_LSCH0 (BIT(16))
#define LEDC_OVF_CNT_RESET_LSCH0_M (BIT(16))
#define LEDC_OVF_CNT_RESET_LSCH0_V 0x1
#define LEDC_OVF_CNT_RESET_LSCH0_S 16
/* LEDC_OVF_CNT_EN_LSCH0 : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_EN_LSCH0 (BIT(15))
#define LEDC_OVF_CNT_EN_LSCH0_M (BIT(15))
#define LEDC_OVF_CNT_EN_LSCH0_V 0x1
#define LEDC_OVF_CNT_EN_LSCH0_S 15
/* LEDC_OVF_NUM_LSCH0 : R/W ;bitpos:[14:5] ;default: 10'b0 ; */
/*description: */
#define LEDC_OVF_NUM_LSCH0 0x000003FF
#define LEDC_OVF_NUM_LSCH0_M ((LEDC_OVF_NUM_LSCH0_V) << (LEDC_OVF_NUM_LSCH0_S))
#define LEDC_OVF_NUM_LSCH0_V 0x3FF
#define LEDC_OVF_NUM_LSCH0_S 5
/* LEDC_PARA_UP_LSCH0 : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define LEDC_PARA_UP_LSCH0 (BIT(4))
#define LEDC_PARA_UP_LSCH0_M (BIT(4))
#define LEDC_PARA_UP_LSCH0_V 0x1
#define LEDC_PARA_UP_LSCH0_S 4
/* LEDC_IDLE_LV_LSCH0 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define LEDC_IDLE_LV_LSCH0 (BIT(3))
#define LEDC_IDLE_LV_LSCH0_M (BIT(3))
#define LEDC_IDLE_LV_LSCH0_V 0x1
#define LEDC_IDLE_LV_LSCH0_S 3
/* LEDC_SIG_OUT_EN_LSCH0 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define LEDC_SIG_OUT_EN_LSCH0 (BIT(2))
#define LEDC_SIG_OUT_EN_LSCH0_M (BIT(2))
#define LEDC_SIG_OUT_EN_LSCH0_V 0x1
#define LEDC_SIG_OUT_EN_LSCH0_S 2
/* LEDC_TIMER_SEL_LSCH0 : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: */
#define LEDC_TIMER_SEL_LSCH0 0x00000003
#define LEDC_TIMER_SEL_LSCH0_M ((LEDC_TIMER_SEL_LSCH0_V) << (LEDC_TIMER_SEL_LSCH0_S))
#define LEDC_TIMER_SEL_LSCH0_V 0x3
#define LEDC_TIMER_SEL_LSCH0_S 0

#define LEDC_LSCH0_HPOINT_REG (DR_REG_LEDC_BASE + 0x0004)
/* LEDC_HPOINT_LSCH0 : R/W ;bitpos:[13:0] ;default: 14'h0 ; */
/*description: */
#define LEDC_HPOINT_LSCH0 0x00003FFF
#define LEDC_HPOINT_LSCH0_M ((LEDC_HPOINT_LSCH0_V) << (LEDC_HPOINT_LSCH0_S))
#define LEDC_HPOINT_LSCH0_V 0x3FFF
#define LEDC_HPOINT_LSCH0_S 0

#define LEDC_LSCH0_DUTY_REG (DR_REG_LEDC_BASE + 0x0008)
/* LEDC_DUTY_LSCH0 : R/W ;bitpos:[18:0] ;default: 19'h0 ; */
/*description: */
#define LEDC_DUTY_LSCH0 0x0007FFFF
#define LEDC_DUTY_LSCH0_M ((LEDC_DUTY_LSCH0_V) << (LEDC_DUTY_LSCH0_S))
#define LEDC_DUTY_LSCH0_V 0x7FFFF
#define LEDC_DUTY_LSCH0_S 0

#define LEDC_LSCH0_CONF1_REG (DR_REG_LEDC_BASE + 0x000C)
/* LEDC_DUTY_START_LSCH0 : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_START_LSCH0 (BIT(31))
#define LEDC_DUTY_START_LSCH0_M (BIT(31))
#define LEDC_DUTY_START_LSCH0_V 0x1
#define LEDC_DUTY_START_LSCH0_S 31
/* LEDC_DUTY_INC_LSCH0 : R/W ;bitpos:[30] ;default: 1'b1 ; */
/*description: */
#define LEDC_DUTY_INC_LSCH0 (BIT(30))
#define LEDC_DUTY_INC_LSCH0_M (BIT(30))
#define LEDC_DUTY_INC_LSCH0_V 0x1
#define LEDC_DUTY_INC_LSCH0_S 30
/* LEDC_DUTY_NUM_LSCH0 : R/W ;bitpos:[29:20] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_NUM_LSCH0 0x000003FF
#define LEDC_DUTY_NUM_LSCH0_M ((LEDC_DUTY_NUM_LSCH0_V) << (LEDC_DUTY_NUM_LSCH0_S))
#define LEDC_DUTY_NUM_LSCH0_V 0x3FF
#define LEDC_DUTY_NUM_LSCH0_S 20
/* LEDC_DUTY_CYCLE_LSCH0 : R/W ;bitpos:[19:10] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_CYCLE_LSCH0 0x000003FF
#define LEDC_DUTY_CYCLE_LSCH0_M ((LEDC_DUTY_CYCLE_LSCH0_V) << (LEDC_DUTY_CYCLE_LSCH0_S))
#define LEDC_DUTY_CYCLE_LSCH0_V 0x3FF
#define LEDC_DUTY_CYCLE_LSCH0_S 10
/* LEDC_DUTY_SCALE_LSCH0 : R/W ;bitpos:[9:0] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_SCALE_LSCH0 0x000003FF
#define LEDC_DUTY_SCALE_LSCH0_M ((LEDC_DUTY_SCALE_LSCH0_V) << (LEDC_DUTY_SCALE_LSCH0_S))
#define LEDC_DUTY_SCALE_LSCH0_V 0x3FF
#define LEDC_DUTY_SCALE_LSCH0_S 0

#define LEDC_LSCH0_DUTY_R_REG (DR_REG_LEDC_BASE + 0x0010)
/* LEDC_DUTY_LSCH0 : RO ;bitpos:[18:0] ;default: 19'h0 ; */
/*description: */
#define LEDC_DUTY_LSCH0 0x0007FFFF
#define LEDC_DUTY_LSCH0_M ((LEDC_DUTY_LSCH0_V) << (LEDC_DUTY_LSCH0_S))
#define LEDC_DUTY_LSCH0_V 0x7FFFF
#define LEDC_DUTY_LSCH0_S 0

#define LEDC_LSCH1_CONF0_REG (DR_REG_LEDC_BASE + 0x0014)
/* LEDC_OVF_CNT_RESET_ST_LSCH1 : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_RESET_ST_LSCH1 (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_LSCH1_M (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_LSCH1_V 0x1
#define LEDC_OVF_CNT_RESET_ST_LSCH1_S 17
/* LEDC_OVF_CNT_RESET_LSCH1 : WO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_RESET_LSCH1 (BIT(16))
#define LEDC_OVF_CNT_RESET_LSCH1_M (BIT(16))
#define LEDC_OVF_CNT_RESET_LSCH1_V 0x1
#define LEDC_OVF_CNT_RESET_LSCH1_S 16
/* LEDC_OVF_CNT_EN_LSCH1 : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_EN_LSCH1 (BIT(15))
#define LEDC_OVF_CNT_EN_LSCH1_M (BIT(15))
#define LEDC_OVF_CNT_EN_LSCH1_V 0x1
#define LEDC_OVF_CNT_EN_LSCH1_S 15
/* LEDC_OVF_NUM_LSCH1 : R/W ;bitpos:[14:5] ;default: 10'b0 ; */
/*description: */
#define LEDC_OVF_NUM_LSCH1 0x000003FF
#define LEDC_OVF_NUM_LSCH1_M ((LEDC_OVF_NUM_LSCH1_V) << (LEDC_OVF_NUM_LSCH1_S))
#define LEDC_OVF_NUM_LSCH1_V 0x3FF
#define LEDC_OVF_NUM_LSCH1_S 5
/* LEDC_PARA_UP_LSCH1 : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define LEDC_PARA_UP_LSCH1 (BIT(4))
#define LEDC_PARA_UP_LSCH1_M (BIT(4))
#define LEDC_PARA_UP_LSCH1_V 0x1
#define LEDC_PARA_UP_LSCH1_S 4
/* LEDC_IDLE_LV_LSCH1 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define LEDC_IDLE_LV_LSCH1 (BIT(3))
#define LEDC_IDLE_LV_LSCH1_M (BIT(3))
#define LEDC_IDLE_LV_LSCH1_V 0x1
#define LEDC_IDLE_LV_LSCH1_S 3
/* LEDC_SIG_OUT_EN_LSCH1 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define LEDC_SIG_OUT_EN_LSCH1 (BIT(2))
#define LEDC_SIG_OUT_EN_LSCH1_M (BIT(2))
#define LEDC_SIG_OUT_EN_LSCH1_V 0x1
#define LEDC_SIG_OUT_EN_LSCH1_S 2
/* LEDC_TIMER_SEL_LSCH1 : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: */
#define LEDC_TIMER_SEL_LSCH1 0x00000003
#define LEDC_TIMER_SEL_LSCH1_M ((LEDC_TIMER_SEL_LSCH1_V) << (LEDC_TIMER_SEL_LSCH1_S))
#define LEDC_TIMER_SEL_LSCH1_V 0x3
#define LEDC_TIMER_SEL_LSCH1_S 0

#define LEDC_LSCH1_HPOINT_REG (DR_REG_LEDC_BASE + 0x0018)
/* LEDC_HPOINT_LSCH1 : R/W ;bitpos:[13:0] ;default: 14'h0 ; */
/*description: */
#define LEDC_HPOINT_LSCH1 0x00003FFF
#define LEDC_HPOINT_LSCH1_M ((LEDC_HPOINT_LSCH1_V) << (LEDC_HPOINT_LSCH1_S))
#define LEDC_HPOINT_LSCH1_V 0x3FFF
#define LEDC_HPOINT_LSCH1_S 0

#define LEDC_LSCH1_DUTY_REG (DR_REG_LEDC_BASE + 0x001C)
/* LEDC_DUTY_LSCH1 : R/W ;bitpos:[18:0] ;default: 19'h0 ; */
/*description: */
#define LEDC_DUTY_LSCH1 0x0007FFFF
#define LEDC_DUTY_LSCH1_M ((LEDC_DUTY_LSCH1_V) << (LEDC_DUTY_LSCH1_S))
#define LEDC_DUTY_LSCH1_V 0x7FFFF
#define LEDC_DUTY_LSCH1_S 0

#define LEDC_LSCH1_CONF1_REG (DR_REG_LEDC_BASE + 0x0020)
/* LEDC_DUTY_START_LSCH1 : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_START_LSCH1 (BIT(31))
#define LEDC_DUTY_START_LSCH1_M (BIT(31))
#define LEDC_DUTY_START_LSCH1_V 0x1
#define LEDC_DUTY_START_LSCH1_S 31
/* LEDC_DUTY_INC_LSCH1 : R/W ;bitpos:[30] ;default: 1'b1 ; */
/*description: */
#define LEDC_DUTY_INC_LSCH1 (BIT(30))
#define LEDC_DUTY_INC_LSCH1_M (BIT(30))
#define LEDC_DUTY_INC_LSCH1_V 0x1
#define LEDC_DUTY_INC_LSCH1_S 30
/* LEDC_DUTY_NUM_LSCH1 : R/W ;bitpos:[29:20] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_NUM_LSCH1 0x000003FF
#define LEDC_DUTY_NUM_LSCH1_M ((LEDC_DUTY_NUM_LSCH1_V) << (LEDC_DUTY_NUM_LSCH1_S))
#define LEDC_DUTY_NUM_LSCH1_V 0x3FF
#define LEDC_DUTY_NUM_LSCH1_S 20
/* LEDC_DUTY_CYCLE_LSCH1 : R/W ;bitpos:[19:10] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_CYCLE_LSCH1 0x000003FF
#define LEDC_DUTY_CYCLE_LSCH1_M ((LEDC_DUTY_CYCLE_LSCH1_V) << (LEDC_DUTY_CYCLE_LSCH1_S))
#define LEDC_DUTY_CYCLE_LSCH1_V 0x3FF
#define LEDC_DUTY_CYCLE_LSCH1_S 10
/* LEDC_DUTY_SCALE_LSCH1 : R/W ;bitpos:[9:0] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_SCALE_LSCH1 0x000003FF
#define LEDC_DUTY_SCALE_LSCH1_M ((LEDC_DUTY_SCALE_LSCH1_V) << (LEDC_DUTY_SCALE_LSCH1_S))
#define LEDC_DUTY_SCALE_LSCH1_V 0x3FF
#define LEDC_DUTY_SCALE_LSCH1_S 0

#define LEDC_LSCH1_DUTY_R_REG (DR_REG_LEDC_BASE + 0x0024)
/* LEDC_DUTY_LSCH1 : RO ;bitpos:[18:0] ;default: 19'h0 ; */
/*description: */
#define LEDC_DUTY_LSCH1 0x0007FFFF
#define LEDC_DUTY_LSCH1_M ((LEDC_DUTY_LSCH1_V) << (LEDC_DUTY_LSCH1_S))
#define LEDC_DUTY_LSCH1_V 0x7FFFF
#define LEDC_DUTY_LSCH1_S 0

#define LEDC_LSCH2_CONF0_REG (DR_REG_LEDC_BASE + 0x0028)
/* LEDC_OVF_CNT_RESET_ST_LSCH2 : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_RESET_ST_LSCH2 (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_LSCH2_M (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_LSCH2_V 0x1
#define LEDC_OVF_CNT_RESET_ST_LSCH2_S 17
/* LEDC_OVF_CNT_RESET_LSCH2 : WO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_RESET_LSCH2 (BIT(16))
#define LEDC_OVF_CNT_RESET_LSCH2_M (BIT(16))
#define LEDC_OVF_CNT_RESET_LSCH2_V 0x1
#define LEDC_OVF_CNT_RESET_LSCH2_S 16
/* LEDC_OVF_CNT_EN_LSCH2 : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_EN_LSCH2 (BIT(15))
#define LEDC_OVF_CNT_EN_LSCH2_M (BIT(15))
#define LEDC_OVF_CNT_EN_LSCH2_V 0x1
#define LEDC_OVF_CNT_EN_LSCH2_S 15
/* LEDC_OVF_NUM_LSCH2 : R/W ;bitpos:[14:5] ;default: 10'b0 ; */
/*description: */
#define LEDC_OVF_NUM_LSCH2 0x000003FF
#define LEDC_OVF_NUM_LSCH2_M ((LEDC_OVF_NUM_LSCH2_V) << (LEDC_OVF_NUM_LSCH2_S))
#define LEDC_OVF_NUM_LSCH2_V 0x3FF
#define LEDC_OVF_NUM_LSCH2_S 5
/* LEDC_PARA_UP_LSCH2 : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define LEDC_PARA_UP_LSCH2 (BIT(4))
#define LEDC_PARA_UP_LSCH2_M (BIT(4))
#define LEDC_PARA_UP_LSCH2_V 0x1
#define LEDC_PARA_UP_LSCH2_S 4
/* LEDC_IDLE_LV_LSCH2 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define LEDC_IDLE_LV_LSCH2 (BIT(3))
#define LEDC_IDLE_LV_LSCH2_M (BIT(3))
#define LEDC_IDLE_LV_LSCH2_V 0x1
#define LEDC_IDLE_LV_LSCH2_S 3
/* LEDC_SIG_OUT_EN_LSCH2 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define LEDC_SIG_OUT_EN_LSCH2 (BIT(2))
#define LEDC_SIG_OUT_EN_LSCH2_M (BIT(2))
#define LEDC_SIG_OUT_EN_LSCH2_V 0x1
#define LEDC_SIG_OUT_EN_LSCH2_S 2
/* LEDC_TIMER_SEL_LSCH2 : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: */
#define LEDC_TIMER_SEL_LSCH2 0x00000003
#define LEDC_TIMER_SEL_LSCH2_M ((LEDC_TIMER_SEL_LSCH2_V) << (LEDC_TIMER_SEL_LSCH2_S))
#define LEDC_TIMER_SEL_LSCH2_V 0x3
#define LEDC_TIMER_SEL_LSCH2_S 0

#define LEDC_LSCH2_HPOINT_REG (DR_REG_LEDC_BASE + 0x002C)
/* LEDC_HPOINT_LSCH2 : R/W ;bitpos:[13:0] ;default: 14'h0 ; */
/*description: */
#define LEDC_HPOINT_LSCH2 0x00003FFF
#define LEDC_HPOINT_LSCH2_M ((LEDC_HPOINT_LSCH2_V) << (LEDC_HPOINT_LSCH2_S))
#define LEDC_HPOINT_LSCH2_V 0x3FFF
#define LEDC_HPOINT_LSCH2_S 0

#define LEDC_LSCH2_DUTY_REG (DR_REG_LEDC_BASE + 0x0030)
/* LEDC_DUTY_LSCH2 : R/W ;bitpos:[18:0] ;default: 19'h0 ; */
/*description: */
#define LEDC_DUTY_LSCH2 0x0007FFFF
#define LEDC_DUTY_LSCH2_M ((LEDC_DUTY_LSCH2_V) << (LEDC_DUTY_LSCH2_S))
#define LEDC_DUTY_LSCH2_V 0x7FFFF
#define LEDC_DUTY_LSCH2_S 0

#define LEDC_LSCH2_CONF1_REG (DR_REG_LEDC_BASE + 0x0034)
/* LEDC_DUTY_START_LSCH2 : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_START_LSCH2 (BIT(31))
#define LEDC_DUTY_START_LSCH2_M (BIT(31))
#define LEDC_DUTY_START_LSCH2_V 0x1
#define LEDC_DUTY_START_LSCH2_S 31
/* LEDC_DUTY_INC_LSCH2 : R/W ;bitpos:[30] ;default: 1'b1 ; */
/*description: */
#define LEDC_DUTY_INC_LSCH2 (BIT(30))
#define LEDC_DUTY_INC_LSCH2_M (BIT(30))
#define LEDC_DUTY_INC_LSCH2_V 0x1
#define LEDC_DUTY_INC_LSCH2_S 30
/* LEDC_DUTY_NUM_LSCH2 : R/W ;bitpos:[29:20] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_NUM_LSCH2 0x000003FF
#define LEDC_DUTY_NUM_LSCH2_M ((LEDC_DUTY_NUM_LSCH2_V) << (LEDC_DUTY_NUM_LSCH2_S))
#define LEDC_DUTY_NUM_LSCH2_V 0x3FF
#define LEDC_DUTY_NUM_LSCH2_S 20
/* LEDC_DUTY_CYCLE_LSCH2 : R/W ;bitpos:[19:10] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_CYCLE_LSCH2 0x000003FF
#define LEDC_DUTY_CYCLE_LSCH2_M ((LEDC_DUTY_CYCLE_LSCH2_V) << (LEDC_DUTY_CYCLE_LSCH2_S))
#define LEDC_DUTY_CYCLE_LSCH2_V 0x3FF
#define LEDC_DUTY_CYCLE_LSCH2_S 10
/* LEDC_DUTY_SCALE_LSCH2 : R/W ;bitpos:[9:0] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_SCALE_LSCH2 0x000003FF
#define LEDC_DUTY_SCALE_LSCH2_M ((LEDC_DUTY_SCALE_LSCH2_V) << (LEDC_DUTY_SCALE_LSCH2_S))
#define LEDC_DUTY_SCALE_LSCH2_V 0x3FF
#define LEDC_DUTY_SCALE_LSCH2_S 0

#define LEDC_LSCH2_DUTY_R_REG (DR_REG_LEDC_BASE + 0x0038)
/* LEDC_DUTY_LSCH2 : RO ;bitpos:[18:0] ;default: 19'h0 ; */
/*description: */
#define LEDC_DUTY_LSCH2 0x0007FFFF
#define LEDC_DUTY_LSCH2_M ((LEDC_DUTY_LSCH2_V) << (LEDC_DUTY_LSCH2_S))
#define LEDC_DUTY_LSCH2_V 0x7FFFF
#define LEDC_DUTY_LSCH2_S 0

#define LEDC_LSCH3_CONF0_REG (DR_REG_LEDC_BASE + 0x003C)
/* LEDC_OVF_CNT_RESET_ST_LSCH3 : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_RESET_ST_LSCH3 (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_LSCH3_M (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_LSCH3_V 0x1
#define LEDC_OVF_CNT_RESET_ST_LSCH3_S 17
/* LEDC_OVF_CNT_RESET_LSCH3 : WO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_RESET_LSCH3 (BIT(16))
#define LEDC_OVF_CNT_RESET_LSCH3_M (BIT(16))
#define LEDC_OVF_CNT_RESET_LSCH3_V 0x1
#define LEDC_OVF_CNT_RESET_LSCH3_S 16
/* LEDC_OVF_CNT_EN_LSCH3 : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_EN_LSCH3 (BIT(15))
#define LEDC_OVF_CNT_EN_LSCH3_M (BIT(15))
#define LEDC_OVF_CNT_EN_LSCH3_V 0x1
#define LEDC_OVF_CNT_EN_LSCH3_S 15
/* LEDC_OVF_NUM_LSCH3 : R/W ;bitpos:[14:5] ;default: 10'b0 ; */
/*description: */
#define LEDC_OVF_NUM_LSCH3 0x000003FF
#define LEDC_OVF_NUM_LSCH3_M ((LEDC_OVF_NUM_LSCH3_V) << (LEDC_OVF_NUM_LSCH3_S))
#define LEDC_OVF_NUM_LSCH3_V 0x3FF
#define LEDC_OVF_NUM_LSCH3_S 5
/* LEDC_PARA_UP_LSCH3 : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define LEDC_PARA_UP_LSCH3 (BIT(4))
#define LEDC_PARA_UP_LSCH3_M (BIT(4))
#define LEDC_PARA_UP_LSCH3_V 0x1
#define LEDC_PARA_UP_LSCH3_S 4
/* LEDC_IDLE_LV_LSCH3 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define LEDC_IDLE_LV_LSCH3 (BIT(3))
#define LEDC_IDLE_LV_LSCH3_M (BIT(3))
#define LEDC_IDLE_LV_LSCH3_V 0x1
#define LEDC_IDLE_LV_LSCH3_S 3
/* LEDC_SIG_OUT_EN_LSCH3 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define LEDC_SIG_OUT_EN_LSCH3 (BIT(2))
#define LEDC_SIG_OUT_EN_LSCH3_M (BIT(2))
#define LEDC_SIG_OUT_EN_LSCH3_V 0x1
#define LEDC_SIG_OUT_EN_LSCH3_S 2
/* LEDC_TIMER_SEL_LSCH3 : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: */
#define LEDC_TIMER_SEL_LSCH3 0x00000003
#define LEDC_TIMER_SEL_LSCH3_M ((LEDC_TIMER_SEL_LSCH3_V) << (LEDC_TIMER_SEL_LSCH3_S))
#define LEDC_TIMER_SEL_LSCH3_V 0x3
#define LEDC_TIMER_SEL_LSCH3_S 0

#define LEDC_LSCH3_HPOINT_REG (DR_REG_LEDC_BASE + 0x0040)
/* LEDC_HPOINT_LSCH3 : R/W ;bitpos:[13:0] ;default: 14'h0 ; */
/*description: */
#define LEDC_HPOINT_LSCH3 0x00003FFF
#define LEDC_HPOINT_LSCH3_M ((LEDC_HPOINT_LSCH3_V) << (LEDC_HPOINT_LSCH3_S))
#define LEDC_HPOINT_LSCH3_V 0x3FFF
#define LEDC_HPOINT_LSCH3_S 0

