espressif/esp-idf/components/soc/esp32s3/include/soc/ledc_reg.h
#define LEDC_LSCH3_DUTY_REG (DR_REG_LEDC_BASE + 0x0044)
/* LEDC_DUTY_LSCH3 : R/W ;bitpos:[18:0] ;default: 19'h0 ; */
/*description: */
#define LEDC_DUTY_LSCH3 0x0007FFFF
#define LEDC_DUTY_LSCH3_M ((LEDC_DUTY_LSCH3_V) << (LEDC_DUTY_LSCH3_S))
#define LEDC_DUTY_LSCH3_V 0x7FFFF
#define LEDC_DUTY_LSCH3_S 0

#define LEDC_LSCH3_CONF1_REG (DR_REG_LEDC_BASE + 0x0048)
/* LEDC_DUTY_START_LSCH3 : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_START_LSCH3 (BIT(31))
#define LEDC_DUTY_START_LSCH3_M (BIT(31))
#define LEDC_DUTY_START_LSCH3_V 0x1
#define LEDC_DUTY_START_LSCH3_S 31
/* LEDC_DUTY_INC_LSCH3 : R/W ;bitpos:[30] ;default: 1'b1 ; */
/*description: */
#define LEDC_DUTY_INC_LSCH3 (BIT(30))
#define LEDC_DUTY_INC_LSCH3_M (BIT(30))
#define LEDC_DUTY_INC_LSCH3_V 0x1
#define LEDC_DUTY_INC_LSCH3_S 30
/* LEDC_DUTY_NUM_LSCH3 : R/W ;bitpos:[29:20] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_NUM_LSCH3 0x000003FF
#define LEDC_DUTY_NUM_LSCH3_M ((LEDC_DUTY_NUM_LSCH3_V) << (LEDC_DUTY_NUM_LSCH3_S))
#define LEDC_DUTY_NUM_LSCH3_V 0x3FF
#define LEDC_DUTY_NUM_LSCH3_S 20
/* LEDC_DUTY_CYCLE_LSCH3 : R/W ;bitpos:[19:10] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_CYCLE_LSCH3 0x000003FF
#define LEDC_DUTY_CYCLE_LSCH3_M ((LEDC_DUTY_CYCLE_LSCH3_V) << (LEDC_DUTY_CYCLE_LSCH3_S))
#define LEDC_DUTY_CYCLE_LSCH3_V 0x3FF
#define LEDC_DUTY_CYCLE_LSCH3_S 10
/* LEDC_DUTY_SCALE_LSCH3 : R/W ;bitpos:[9:0] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_SCALE_LSCH3 0x000003FF
#define LEDC_DUTY_SCALE_LSCH3_M ((LEDC_DUTY_SCALE_LSCH3_V) << (LEDC_DUTY_SCALE_LSCH3_S))
#define LEDC_DUTY_SCALE_LSCH3_V 0x3FF
#define LEDC_DUTY_SCALE_LSCH3_S 0

#define LEDC_LSCH3_DUTY_R_REG (DR_REG_LEDC_BASE + 0x004C)
/* LEDC_DUTY_LSCH3 : RO ;bitpos:[18:0] ;default: 19'h0 ; */
/*description: */
#define LEDC_DUTY_LSCH3 0x0007FFFF
#define LEDC_DUTY_LSCH3_M ((LEDC_DUTY_LSCH3_V) << (LEDC_DUTY_LSCH3_S))
#define LEDC_DUTY_LSCH3_V 0x7FFFF
#define LEDC_DUTY_LSCH3_S 0

#define LEDC_LSCH4_CONF0_REG (DR_REG_LEDC_BASE + 0x0050)
/* LEDC_OVF_CNT_RESET_ST_LSCH4 : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_RESET_ST_LSCH4 (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_LSCH4_M (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_LSCH4_V 0x1
#define LEDC_OVF_CNT_RESET_ST_LSCH4_S 17
/* LEDC_OVF_CNT_RESET_LSCH4 : WO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_RESET_LSCH4 (BIT(16))
#define LEDC_OVF_CNT_RESET_LSCH4_M (BIT(16))
#define LEDC_OVF_CNT_RESET_LSCH4_V 0x1
#define LEDC_OVF_CNT_RESET_LSCH4_S 16
/* LEDC_OVF_CNT_EN_LSCH4 : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_EN_LSCH4 (BIT(15))
#define LEDC_OVF_CNT_EN_LSCH4_M (BIT(15))
#define LEDC_OVF_CNT_EN_LSCH4_V 0x1
#define LEDC_OVF_CNT_EN_LSCH4_S 15
/* LEDC_OVF_NUM_LSCH4 : R/W ;bitpos:[14:5] ;default: 10'b0 ; */
/*description: */
#define LEDC_OVF_NUM_LSCH4 0x000003FF
#define LEDC_OVF_NUM_LSCH4_M ((LEDC_OVF_NUM_LSCH4_V) << (LEDC_OVF_NUM_LSCH4_S))
#define LEDC_OVF_NUM_LSCH4_V 0x3FF
#define LEDC_OVF_NUM_LSCH4_S 5
/* LEDC_PARA_UP_LSCH4 : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define LEDC_PARA_UP_LSCH4 (BIT(4))
#define LEDC_PARA_UP_LSCH4_M (BIT(4))
#define LEDC_PARA_UP_LSCH4_V 0x1
#define LEDC_PARA_UP_LSCH4_S 4
/* LEDC_IDLE_LV_LSCH4 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define LEDC_IDLE_LV_LSCH4 (BIT(3))
#define LEDC_IDLE_LV_LSCH4_M (BIT(3))
#define LEDC_IDLE_LV_LSCH4_V 0x1
#define LEDC_IDLE_LV_LSCH4_S 3
/* LEDC_SIG_OUT_EN_LSCH4 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define LEDC_SIG_OUT_EN_LSCH4 (BIT(2))
#define LEDC_SIG_OUT_EN_LSCH4_M (BIT(2))
#define LEDC_SIG_OUT_EN_LSCH4_V 0x1
#define LEDC_SIG_OUT_EN_LSCH4_S 2
/* LEDC_TIMER_SEL_LSCH4 : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: */
#define LEDC_TIMER_SEL_LSCH4 0x00000003
#define LEDC_TIMER_SEL_LSCH4_M ((LEDC_TIMER_SEL_LSCH4_V) << (LEDC_TIMER_SEL_LSCH4_S))
#define LEDC_TIMER_SEL_LSCH4_V 0x3
#define LEDC_TIMER_SEL_LSCH4_S 0

#define LEDC_LSCH4_HPOINT_REG (DR_REG_LEDC_BASE + 0x0054)
/* LEDC_HPOINT_LSCH4 : R/W ;bitpos:[13:0] ;default: 14'h0 ; */
/*description: */
#define LEDC_HPOINT_LSCH4 0x00003FFF
#define LEDC_HPOINT_LSCH4_M ((LEDC_HPOINT_LSCH4_V) << (LEDC_HPOINT_LSCH4_S))
#define LEDC_HPOINT_LSCH4_V 0x3FFF
#define LEDC_HPOINT_LSCH4_S 0

#define LEDC_LSCH4_DUTY_REG (DR_REG_LEDC_BASE + 0x0058)
/* LEDC_DUTY_LSCH4 : R/W ;bitpos:[18:0] ;default: 19'h0 ; */
/*description: */
#define LEDC_DUTY_LSCH4 0x0007FFFF
#define LEDC_DUTY_LSCH4_M ((LEDC_DUTY_LSCH4_V) << (LEDC_DUTY_LSCH4_S))
#define LEDC_DUTY_LSCH4_V 0x7FFFF
#define LEDC_DUTY_LSCH4_S 0

#define LEDC_LSCH4_CONF1_REG (DR_REG_LEDC_BASE + 0x005C)
/* LEDC_DUTY_START_LSCH4 : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_START_LSCH4 (BIT(31))
#define LEDC_DUTY_START_LSCH4_M (BIT(31))
#define LEDC_DUTY_START_LSCH4_V 0x1
#define LEDC_DUTY_START_LSCH4_S 31
/* LEDC_DUTY_INC_LSCH4 : R/W ;bitpos:[30] ;default: 1'b1 ; */
/*description: */
#define LEDC_DUTY_INC_LSCH4 (BIT(30))
#define LEDC_DUTY_INC_LSCH4_M (BIT(30))
#define LEDC_DUTY_INC_LSCH4_V 0x1
#define LEDC_DUTY_INC_LSCH4_S 30
/* LEDC_DUTY_NUM_LSCH4 : R/W ;bitpos:[29:20] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_NUM_LSCH4 0x000003FF
#define LEDC_DUTY_NUM_LSCH4_M ((LEDC_DUTY_NUM_LSCH4_V) << (LEDC_DUTY_NUM_LSCH4_S))
#define LEDC_DUTY_NUM_LSCH4_V 0x3FF
#define LEDC_DUTY_NUM_LSCH4_S 20
/* LEDC_DUTY_CYCLE_LSCH4 : R/W ;bitpos:[19:10] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_CYCLE_LSCH4 0x000003FF
#define LEDC_DUTY_CYCLE_LSCH4_M ((LEDC_DUTY_CYCLE_LSCH4_V) << (LEDC_DUTY_CYCLE_LSCH4_S))
#define LEDC_DUTY_CYCLE_LSCH4_V 0x3FF
#define LEDC_DUTY_CYCLE_LSCH4_S 10
/* LEDC_DUTY_SCALE_LSCH4 : R/W ;bitpos:[9:0] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_SCALE_LSCH4 0x000003FF
#define LEDC_DUTY_SCALE_LSCH4_M ((LEDC_DUTY_SCALE_LSCH4_V) << (LEDC_DUTY_SCALE_LSCH4_S))
#define LEDC_DUTY_SCALE_LSCH4_V 0x3FF
#define LEDC_DUTY_SCALE_LSCH4_S 0

#define LEDC_LSCH4_DUTY_R_REG (DR_REG_LEDC_BASE + 0x0060)
/* LEDC_DUTY_LSCH4 : RO ;bitpos:[18:0] ;default: 19'h0 ; */
/*description: */
#define LEDC_DUTY_LSCH4 0x0007FFFF
#define LEDC_DUTY_LSCH4_M ((LEDC_DUTY_LSCH4_V) << (LEDC_DUTY_LSCH4_S))
#define LEDC_DUTY_LSCH4_V 0x7FFFF
#define LEDC_DUTY_LSCH4_S 0

