espressif/esp-idf/components/soc/esp32s3/include/soc/ledc_reg.h
#define LEDC_LSCH5_CONF0_REG (DR_REG_LEDC_BASE + 0x0064)
/* LEDC_OVF_CNT_RESET_ST_LSCH5 : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_RESET_ST_LSCH5 (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_LSCH5_M (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_LSCH5_V 0x1
#define LEDC_OVF_CNT_RESET_ST_LSCH5_S 17
/* LEDC_OVF_CNT_RESET_LSCH5 : WO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_RESET_LSCH5 (BIT(16))
#define LEDC_OVF_CNT_RESET_LSCH5_M (BIT(16))
#define LEDC_OVF_CNT_RESET_LSCH5_V 0x1
#define LEDC_OVF_CNT_RESET_LSCH5_S 16
/* LEDC_OVF_CNT_EN_LSCH5 : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_EN_LSCH5 (BIT(15))
#define LEDC_OVF_CNT_EN_LSCH5_M (BIT(15))
#define LEDC_OVF_CNT_EN_LSCH5_V 0x1
#define LEDC_OVF_CNT_EN_LSCH5_S 15
/* LEDC_OVF_NUM_LSCH5 : R/W ;bitpos:[14:5] ;default: 10'b0 ; */
/*description: */
#define LEDC_OVF_NUM_LSCH5 0x000003FF
#define LEDC_OVF_NUM_LSCH5_M ((LEDC_OVF_NUM_LSCH5_V) << (LEDC_OVF_NUM_LSCH5_S))
#define LEDC_OVF_NUM_LSCH5_V 0x3FF
#define LEDC_OVF_NUM_LSCH5_S 5
/* LEDC_PARA_UP_LSCH5 : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define LEDC_PARA_UP_LSCH5 (BIT(4))
#define LEDC_PARA_UP_LSCH5_M (BIT(4))
#define LEDC_PARA_UP_LSCH5_V 0x1
#define LEDC_PARA_UP_LSCH5_S 4
/* LEDC_IDLE_LV_LSCH5 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define LEDC_IDLE_LV_LSCH5 (BIT(3))
#define LEDC_IDLE_LV_LSCH5_M (BIT(3))
#define LEDC_IDLE_LV_LSCH5_V 0x1
#define LEDC_IDLE_LV_LSCH5_S 3
/* LEDC_SIG_OUT_EN_LSCH5 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define LEDC_SIG_OUT_EN_LSCH5 (BIT(2))
#define LEDC_SIG_OUT_EN_LSCH5_M (BIT(2))
#define LEDC_SIG_OUT_EN_LSCH5_V 0x1
#define LEDC_SIG_OUT_EN_LSCH5_S 2
/* LEDC_TIMER_SEL_LSCH5 : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: */
#define LEDC_TIMER_SEL_LSCH5 0x00000003
#define LEDC_TIMER_SEL_LSCH5_M ((LEDC_TIMER_SEL_LSCH5_V) << (LEDC_TIMER_SEL_LSCH5_S))
#define LEDC_TIMER_SEL_LSCH5_V 0x3
#define LEDC_TIMER_SEL_LSCH5_S 0

#define LEDC_LSCH5_HPOINT_REG (DR_REG_LEDC_BASE + 0x0068)
/* LEDC_HPOINT_LSCH5 : R/W ;bitpos:[13:0] ;default: 14'h0 ; */
/*description: */
#define LEDC_HPOINT_LSCH5 0x00003FFF
#define LEDC_HPOINT_LSCH5_M ((LEDC_HPOINT_LSCH5_V) << (LEDC_HPOINT_LSCH5_S))
#define LEDC_HPOINT_LSCH5_V 0x3FFF
#define LEDC_HPOINT_LSCH5_S 0

#define LEDC_LSCH5_DUTY_REG (DR_REG_LEDC_BASE + 0x006C)
/* LEDC_DUTY_LSCH5 : R/W ;bitpos:[18:0] ;default: 19'h0 ; */
/*description: */
#define LEDC_DUTY_LSCH5 0x0007FFFF
#define LEDC_DUTY_LSCH5_M ((LEDC_DUTY_LSCH5_V) << (LEDC_DUTY_LSCH5_S))
#define LEDC_DUTY_LSCH5_V 0x7FFFF
#define LEDC_DUTY_LSCH5_S 0

#define LEDC_LSCH5_CONF1_REG (DR_REG_LEDC_BASE + 0x0070)
/* LEDC_DUTY_START_LSCH5 : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_START_LSCH5 (BIT(31))
#define LEDC_DUTY_START_LSCH5_M (BIT(31))
#define LEDC_DUTY_START_LSCH5_V 0x1
#define LEDC_DUTY_START_LSCH5_S 31
/* LEDC_DUTY_INC_LSCH5 : R/W ;bitpos:[30] ;default: 1'b1 ; */
/*description: */
#define LEDC_DUTY_INC_LSCH5 (BIT(30))
#define LEDC_DUTY_INC_LSCH5_M (BIT(30))
#define LEDC_DUTY_INC_LSCH5_V 0x1
#define LEDC_DUTY_INC_LSCH5_S 30
/* LEDC_DUTY_NUM_LSCH5 : R/W ;bitpos:[29:20] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_NUM_LSCH5 0x000003FF
#define LEDC_DUTY_NUM_LSCH5_M ((LEDC_DUTY_NUM_LSCH5_V) << (LEDC_DUTY_NUM_LSCH5_S))
#define LEDC_DUTY_NUM_LSCH5_V 0x3FF
#define LEDC_DUTY_NUM_LSCH5_S 20
/* LEDC_DUTY_CYCLE_LSCH5 : R/W ;bitpos:[19:10] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_CYCLE_LSCH5 0x000003FF
#define LEDC_DUTY_CYCLE_LSCH5_M ((LEDC_DUTY_CYCLE_LSCH5_V) << (LEDC_DUTY_CYCLE_LSCH5_S))
#define LEDC_DUTY_CYCLE_LSCH5_V 0x3FF
#define LEDC_DUTY_CYCLE_LSCH5_S 10
/* LEDC_DUTY_SCALE_LSCH5 : R/W ;bitpos:[9:0] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_SCALE_LSCH5 0x000003FF
#define LEDC_DUTY_SCALE_LSCH5_M ((LEDC_DUTY_SCALE_LSCH5_V) << (LEDC_DUTY_SCALE_LSCH5_S))
#define LEDC_DUTY_SCALE_LSCH5_V 0x3FF
#define LEDC_DUTY_SCALE_LSCH5_S 0

#define LEDC_LSCH5_DUTY_R_REG (DR_REG_LEDC_BASE + 0x0074)
/* LEDC_DUTY_LSCH5 : RO ;bitpos:[18:0] ;default: 19'h0 ; */
/*description: */
#define LEDC_DUTY_LSCH5 0x0007FFFF
#define LEDC_DUTY_LSCH5_M ((LEDC_DUTY_LSCH5_V) << (LEDC_DUTY_LSCH5_S))
#define LEDC_DUTY_LSCH5_V 0x7FFFF
#define LEDC_DUTY_LSCH5_S 0

#define LEDC_LSCH6_CONF0_REG (DR_REG_LEDC_BASE + 0x0078)
/* LEDC_OVF_CNT_RESET_ST_LSCH6 : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_RESET_ST_LSCH6 (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_LSCH6_M (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_LSCH6_V 0x1
#define LEDC_OVF_CNT_RESET_ST_LSCH6_S 17
/* LEDC_OVF_CNT_RESET_LSCH6 : WO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_RESET_LSCH6 (BIT(16))
#define LEDC_OVF_CNT_RESET_LSCH6_M (BIT(16))
#define LEDC_OVF_CNT_RESET_LSCH6_V 0x1
#define LEDC_OVF_CNT_RESET_LSCH6_S 16
/* LEDC_OVF_CNT_EN_LSCH6 : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_EN_LSCH6 (BIT(15))
#define LEDC_OVF_CNT_EN_LSCH6_M (BIT(15))
#define LEDC_OVF_CNT_EN_LSCH6_V 0x1
#define LEDC_OVF_CNT_EN_LSCH6_S 15
/* LEDC_OVF_NUM_LSCH6 : R/W ;bitpos:[14:5] ;default: 10'b0 ; */
/*description: */
#define LEDC_OVF_NUM_LSCH6 0x000003FF
#define LEDC_OVF_NUM_LSCH6_M ((LEDC_OVF_NUM_LSCH6_V) << (LEDC_OVF_NUM_LSCH6_S))
#define LEDC_OVF_NUM_LSCH6_V 0x3FF
#define LEDC_OVF_NUM_LSCH6_S 5
/* LEDC_PARA_UP_LSCH6 : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define LEDC_PARA_UP_LSCH6 (BIT(4))
#define LEDC_PARA_UP_LSCH6_M (BIT(4))
#define LEDC_PARA_UP_LSCH6_V 0x1
#define LEDC_PARA_UP_LSCH6_S 4
/* LEDC_IDLE_LV_LSCH6 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define LEDC_IDLE_LV_LSCH6 (BIT(3))
#define LEDC_IDLE_LV_LSCH6_M (BIT(3))
#define LEDC_IDLE_LV_LSCH6_V 0x1
#define LEDC_IDLE_LV_LSCH6_S 3
/* LEDC_SIG_OUT_EN_LSCH6 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define LEDC_SIG_OUT_EN_LSCH6 (BIT(2))
#define LEDC_SIG_OUT_EN_LSCH6_M (BIT(2))
#define LEDC_SIG_OUT_EN_LSCH6_V 0x1
#define LEDC_SIG_OUT_EN_LSCH6_S 2
/* LEDC_TIMER_SEL_LSCH6 : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: */
#define LEDC_TIMER_SEL_LSCH6 0x00000003
#define LEDC_TIMER_SEL_LSCH6_M ((LEDC_TIMER_SEL_LSCH6_V) << (LEDC_TIMER_SEL_LSCH6_S))
#define LEDC_TIMER_SEL_LSCH6_V 0x3
#define LEDC_TIMER_SEL_LSCH6_S 0

#define LEDC_LSCH6_HPOINT_REG (DR_REG_LEDC_BASE + 0x007C)
/* LEDC_HPOINT_LSCH6 : R/W ;bitpos:[13:0] ;default: 14'h0 ; */
/*description: */
#define LEDC_HPOINT_LSCH6 0x00003FFF
#define LEDC_HPOINT_LSCH6_M ((LEDC_HPOINT_LSCH6_V) << (LEDC_HPOINT_LSCH6_S))
#define LEDC_HPOINT_LSCH6_V 0x3FFF
#define LEDC_HPOINT_LSCH6_S 0

#define LEDC_LSCH6_DUTY_REG (DR_REG_LEDC_BASE + 0x0080)
/* LEDC_DUTY_LSCH6 : R/W ;bitpos:[18:0] ;default: 19'h0 ; */
/*description: */
#define LEDC_DUTY_LSCH6 0x0007FFFF
#define LEDC_DUTY_LSCH6_M ((LEDC_DUTY_LSCH6_V) << (LEDC_DUTY_LSCH6_S))
#define LEDC_DUTY_LSCH6_V 0x7FFFF
#define LEDC_DUTY_LSCH6_S 0

#define LEDC_LSCH6_CONF1_REG (DR_REG_LEDC_BASE + 0x0084)
/* LEDC_DUTY_START_LSCH6 : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_START_LSCH6 (BIT(31))
#define LEDC_DUTY_START_LSCH6_M (BIT(31))
#define LEDC_DUTY_START_LSCH6_V 0x1
#define LEDC_DUTY_START_LSCH6_S 31
/* LEDC_DUTY_INC_LSCH6 : R/W ;bitpos:[30] ;default: 1'b1 ; */
/*description: */
#define LEDC_DUTY_INC_LSCH6 (BIT(30))
#define LEDC_DUTY_INC_LSCH6_M (BIT(30))
#define LEDC_DUTY_INC_LSCH6_V 0x1
#define LEDC_DUTY_INC_LSCH6_S 30
/* LEDC_DUTY_NUM_LSCH6 : R/W ;bitpos:[29:20] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_NUM_LSCH6 0x000003FF
#define LEDC_DUTY_NUM_LSCH6_M ((LEDC_DUTY_NUM_LSCH6_V) << (LEDC_DUTY_NUM_LSCH6_S))
#define LEDC_DUTY_NUM_LSCH6_V 0x3FF
#define LEDC_DUTY_NUM_LSCH6_S 20
/* LEDC_DUTY_CYCLE_LSCH6 : R/W ;bitpos:[19:10] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_CYCLE_LSCH6 0x000003FF
#define LEDC_DUTY_CYCLE_LSCH6_M ((LEDC_DUTY_CYCLE_LSCH6_V) << (LEDC_DUTY_CYCLE_LSCH6_S))
#define LEDC_DUTY_CYCLE_LSCH6_V 0x3FF
#define LEDC_DUTY_CYCLE_LSCH6_S 10
/* LEDC_DUTY_SCALE_LSCH6 : R/W ;bitpos:[9:0] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_SCALE_LSCH6 0x000003FF
#define LEDC_DUTY_SCALE_LSCH6_M ((LEDC_DUTY_SCALE_LSCH6_V) << (LEDC_DUTY_SCALE_LSCH6_S))
#define LEDC_DUTY_SCALE_LSCH6_V 0x3FF
#define LEDC_DUTY_SCALE_LSCH6_S 0

#define LEDC_LSCH6_DUTY_R_REG (DR_REG_LEDC_BASE + 0x0088)
/* LEDC_DUTY_LSCH6 : RO ;bitpos:[18:0] ;default: 19'h0 ; */
/*description: */
#define LEDC_DUTY_LSCH6 0x0007FFFF
#define LEDC_DUTY_LSCH6_M ((LEDC_DUTY_LSCH6_V) << (LEDC_DUTY_LSCH6_S))
#define LEDC_DUTY_LSCH6_V 0x7FFFF
#define LEDC_DUTY_LSCH6_S 0

#define LEDC_LSCH7_CONF0_REG (DR_REG_LEDC_BASE + 0x008C)
/* LEDC_OVF_CNT_RESET_ST_LSCH7 : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_RESET_ST_LSCH7 (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_LSCH7_M (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_LSCH7_V 0x1
#define LEDC_OVF_CNT_RESET_ST_LSCH7_S 17
/* LEDC_OVF_CNT_RESET_LSCH7 : WO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_RESET_LSCH7 (BIT(16))
#define LEDC_OVF_CNT_RESET_LSCH7_M (BIT(16))
#define LEDC_OVF_CNT_RESET_LSCH7_V 0x1
#define LEDC_OVF_CNT_RESET_LSCH7_S 16
/* LEDC_OVF_CNT_EN_LSCH7 : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_EN_LSCH7 (BIT(15))
#define LEDC_OVF_CNT_EN_LSCH7_M (BIT(15))
#define LEDC_OVF_CNT_EN_LSCH7_V 0x1
#define LEDC_OVF_CNT_EN_LSCH7_S 15
/* LEDC_OVF_NUM_LSCH7 : R/W ;bitpos:[14:5] ;default: 10'b0 ; */
/*description: */
#define LEDC_OVF_NUM_LSCH7 0x000003FF
#define LEDC_OVF_NUM_LSCH7_M ((LEDC_OVF_NUM_LSCH7_V) << (LEDC_OVF_NUM_LSCH7_S))
#define LEDC_OVF_NUM_LSCH7_V 0x3FF
#define LEDC_OVF_NUM_LSCH7_S 5
/* LEDC_PARA_UP_LSCH7 : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define LEDC_PARA_UP_LSCH7 (BIT(4))
#define LEDC_PARA_UP_LSCH7_M (BIT(4))
#define LEDC_PARA_UP_LSCH7_V 0x1
#define LEDC_PARA_UP_LSCH7_S 4
/* LEDC_IDLE_LV_LSCH7 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define LEDC_IDLE_LV_LSCH7 (BIT(3))
#define LEDC_IDLE_LV_LSCH7_M (BIT(3))
#define LEDC_IDLE_LV_LSCH7_V 0x1
#define LEDC_IDLE_LV_LSCH7_S 3
/* LEDC_SIG_OUT_EN_LSCH7 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define LEDC_SIG_OUT_EN_LSCH7 (BIT(2))
#define LEDC_SIG_OUT_EN_LSCH7_M (BIT(2))
#define LEDC_SIG_OUT_EN_LSCH7_V 0x1
#define LEDC_SIG_OUT_EN_LSCH7_S 2
/* LEDC_TIMER_SEL_LSCH7 : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: */
#define LEDC_TIMER_SEL_LSCH7 0x00000003
#define LEDC_TIMER_SEL_LSCH7_M ((LEDC_TIMER_SEL_LSCH7_V) << (LEDC_TIMER_SEL_LSCH7_S))
#define LEDC_TIMER_SEL_LSCH7_V 0x3
#define LEDC_TIMER_SEL_LSCH7_S 0

#define LEDC_LSCH7_HPOINT_REG (DR_REG_LEDC_BASE + 0x0090)
/* LEDC_HPOINT_LSCH7 : R/W ;bitpos:[13:0] ;default: 14'h0 ; */
/*description: */
#define LEDC_HPOINT_LSCH7 0x00003FFF
#define LEDC_HPOINT_LSCH7_M ((LEDC_HPOINT_LSCH7_V) << (LEDC_HPOINT_LSCH7_S))
#define LEDC_HPOINT_LSCH7_V 0x3FFF
#define LEDC_HPOINT_LSCH7_S 0

