espressif/esp-idf/components/soc/esp32s3/include/soc/ledc_reg.h
#define LEDC_LSCH7_DUTY_REG (DR_REG_LEDC_BASE + 0x0094)
/* LEDC_DUTY_LSCH7 : R/W ;bitpos:[18:0] ;default: 19'h0 ; */
/*description: */
#define LEDC_DUTY_LSCH7 0x0007FFFF
#define LEDC_DUTY_LSCH7_M ((LEDC_DUTY_LSCH7_V) << (LEDC_DUTY_LSCH7_S))
#define LEDC_DUTY_LSCH7_V 0x7FFFF
#define LEDC_DUTY_LSCH7_S 0

#define LEDC_LSCH7_CONF1_REG (DR_REG_LEDC_BASE + 0x0098)
/* LEDC_DUTY_START_LSCH7 : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_START_LSCH7 (BIT(31))
#define LEDC_DUTY_START_LSCH7_M (BIT(31))
#define LEDC_DUTY_START_LSCH7_V 0x1
#define LEDC_DUTY_START_LSCH7_S 31
/* LEDC_DUTY_INC_LSCH7 : R/W ;bitpos:[30] ;default: 1'b1 ; */
/*description: */
#define LEDC_DUTY_INC_LSCH7 (BIT(30))
#define LEDC_DUTY_INC_LSCH7_M (BIT(30))
#define LEDC_DUTY_INC_LSCH7_V 0x1
#define LEDC_DUTY_INC_LSCH7_S 30
/* LEDC_DUTY_NUM_LSCH7 : R/W ;bitpos:[29:20] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_NUM_LSCH7 0x000003FF
#define LEDC_DUTY_NUM_LSCH7_M ((LEDC_DUTY_NUM_LSCH7_V) << (LEDC_DUTY_NUM_LSCH7_S))
#define LEDC_DUTY_NUM_LSCH7_V 0x3FF
#define LEDC_DUTY_NUM_LSCH7_S 20
/* LEDC_DUTY_CYCLE_LSCH7 : R/W ;bitpos:[19:10] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_CYCLE_LSCH7 0x000003FF
#define LEDC_DUTY_CYCLE_LSCH7_M ((LEDC_DUTY_CYCLE_LSCH7_V) << (LEDC_DUTY_CYCLE_LSCH7_S))
#define LEDC_DUTY_CYCLE_LSCH7_V 0x3FF
#define LEDC_DUTY_CYCLE_LSCH7_S 10
/* LEDC_DUTY_SCALE_LSCH7 : R/W ;bitpos:[9:0] ;default: 10'h0 ; */
/*description: */
#define LEDC_DUTY_SCALE_LSCH7 0x000003FF
#define LEDC_DUTY_SCALE_LSCH7_M ((LEDC_DUTY_SCALE_LSCH7_V) << (LEDC_DUTY_SCALE_LSCH7_S))
#define LEDC_DUTY_SCALE_LSCH7_V 0x3FF
#define LEDC_DUTY_SCALE_LSCH7_S 0

#define LEDC_LSCH7_DUTY_R_REG (DR_REG_LEDC_BASE + 0x009C)
/* LEDC_DUTY_LSCH7 : RO ;bitpos:[18:0] ;default: 19'h0 ; */
/*description: */
#define LEDC_DUTY_LSCH7 0x0007FFFF
#define LEDC_DUTY_LSCH7_M ((LEDC_DUTY_LSCH7_V) << (LEDC_DUTY_LSCH7_S))
#define LEDC_DUTY_LSCH7_V 0x7FFFF
#define LEDC_DUTY_LSCH7_S 0

#define LEDC_LSTIMER0_CONF_REG (DR_REG_LEDC_BASE + 0x00a0)
/* LEDC_LSTIMER0_PARA_UP : WO ;bitpos:[25] ;default: 1'h0 ; */
/*description: */
#define LEDC_LSTIMER0_PARA_UP (BIT(25))
#define LEDC_LSTIMER0_PARA_UP_M (BIT(25))
#define LEDC_LSTIMER0_PARA_UP_V 0x1
#define LEDC_LSTIMER0_PARA_UP_S 25
/* LEDC_TICK_SEL_LSTIMER0 : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define LEDC_TICK_SEL_LSTIMER0 (BIT(24))
#define LEDC_TICK_SEL_LSTIMER0_M (BIT(24))
#define LEDC_TICK_SEL_LSTIMER0_V 0x1
#define LEDC_TICK_SEL_LSTIMER0_S 24
/* LEDC_LSTIMER0_RST : R/W ;bitpos:[23] ;default: 1'b1 ; */
/*description: */
#define LEDC_LSTIMER0_RST (BIT(23))
#define LEDC_LSTIMER0_RST_M (BIT(23))
#define LEDC_LSTIMER0_RST_V 0x1
#define LEDC_LSTIMER0_RST_S 23
/* LEDC_LSTIMER0_PAUSE : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER0_PAUSE (BIT(22))
#define LEDC_LSTIMER0_PAUSE_M (BIT(22))
#define LEDC_LSTIMER0_PAUSE_V 0x1
#define LEDC_LSTIMER0_PAUSE_S 22
/* LEDC_CLK_DIV_LSTIMER0 : R/W ;bitpos:[21:4] ;default: 18'h0 ; */
/*description: */
#define LEDC_CLK_DIV_LSTIMER0 0x0003FFFF
#define LEDC_CLK_DIV_LSTIMER0_M ((LEDC_CLK_DIV_LSTIMER0_V) << (LEDC_CLK_DIV_LSTIMER0_S))
#define LEDC_CLK_DIV_LSTIMER0_V 0x3FFFF
#define LEDC_CLK_DIV_LSTIMER0_S 4
/* LEDC_LSTIMER0_DUTY_RES : R/W ;bitpos:[3:0] ;default: 4'h0 ; */
/*description: */
#define LEDC_LSTIMER0_DUTY_RES 0x0000000F
#define LEDC_LSTIMER0_DUTY_RES_M ((LEDC_LSTIMER0_DUTY_RES_V) << (LEDC_LSTIMER0_DUTY_RES_S))
#define LEDC_LSTIMER0_DUTY_RES_V 0xF
#define LEDC_LSTIMER0_DUTY_RES_S 0

#define LEDC_LSTIMER0_VALUE_REG (DR_REG_LEDC_BASE + 0x00a4)
/* LEDC_LSTIMER0_CNT : RO ;bitpos:[13:0] ;default: 14'b0 ; */
/*description: */
#define LEDC_LSTIMER0_CNT 0x00003FFF
#define LEDC_LSTIMER0_CNT_M ((LEDC_LSTIMER0_CNT_V) << (LEDC_LSTIMER0_CNT_S))
#define LEDC_LSTIMER0_CNT_V 0x3FFF
#define LEDC_LSTIMER0_CNT_S 0

#define LEDC_LSTIMER1_CONF_REG (DR_REG_LEDC_BASE + 0x00a8)
/* LEDC_LSTIMER1_PARA_UP : WO ;bitpos:[25] ;default: 1'h0 ; */
/*description: */
#define LEDC_LSTIMER1_PARA_UP (BIT(25))
#define LEDC_LSTIMER1_PARA_UP_M (BIT(25))
#define LEDC_LSTIMER1_PARA_UP_V 0x1
#define LEDC_LSTIMER1_PARA_UP_S 25
/* LEDC_TICK_SEL_LSTIMER1 : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define LEDC_TICK_SEL_LSTIMER1 (BIT(24))
#define LEDC_TICK_SEL_LSTIMER1_M (BIT(24))
#define LEDC_TICK_SEL_LSTIMER1_V 0x1
#define LEDC_TICK_SEL_LSTIMER1_S 24
/* LEDC_LSTIMER1_RST : R/W ;bitpos:[23] ;default: 1'b1 ; */
/*description: */
#define LEDC_LSTIMER1_RST (BIT(23))
#define LEDC_LSTIMER1_RST_M (BIT(23))
#define LEDC_LSTIMER1_RST_V 0x1
#define LEDC_LSTIMER1_RST_S 23
/* LEDC_LSTIMER1_PAUSE : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER1_PAUSE (BIT(22))
#define LEDC_LSTIMER1_PAUSE_M (BIT(22))
#define LEDC_LSTIMER1_PAUSE_V 0x1
#define LEDC_LSTIMER1_PAUSE_S 22
/* LEDC_CLK_DIV_LSTIMER1 : R/W ;bitpos:[21:4] ;default: 18'h0 ; */
/*description: */
#define LEDC_CLK_DIV_LSTIMER1 0x0003FFFF
#define LEDC_CLK_DIV_LSTIMER1_M ((LEDC_CLK_DIV_LSTIMER1_V) << (LEDC_CLK_DIV_LSTIMER1_S))
#define LEDC_CLK_DIV_LSTIMER1_V 0x3FFFF
#define LEDC_CLK_DIV_LSTIMER1_S 4
/* LEDC_LSTIMER1_DUTY_RES : R/W ;bitpos:[3:0] ;default: 4'h0 ; */
/*description: */
#define LEDC_LSTIMER1_DUTY_RES 0x0000000F
#define LEDC_LSTIMER1_DUTY_RES_M ((LEDC_LSTIMER1_DUTY_RES_V) << (LEDC_LSTIMER1_DUTY_RES_S))
#define LEDC_LSTIMER1_DUTY_RES_V 0xF
#define LEDC_LSTIMER1_DUTY_RES_S 0

#define LEDC_LSTIMER1_VALUE_REG (DR_REG_LEDC_BASE + 0x00aC)
/* LEDC_LSTIMER1_CNT : RO ;bitpos:[13:0] ;default: 14'b0 ; */
/*description: */
#define LEDC_LSTIMER1_CNT 0x00003FFF
#define LEDC_LSTIMER1_CNT_M ((LEDC_LSTIMER1_CNT_V) << (LEDC_LSTIMER1_CNT_S))
#define LEDC_LSTIMER1_CNT_V 0x3FFF
#define LEDC_LSTIMER1_CNT_S 0

#define LEDC_LSTIMER2_CONF_REG (DR_REG_LEDC_BASE + 0x00b0)
/* LEDC_LSTIMER2_PARA_UP : WO ;bitpos:[25] ;default: 1'h0 ; */
/*description: */
#define LEDC_LSTIMER2_PARA_UP (BIT(25))
#define LEDC_LSTIMER2_PARA_UP_M (BIT(25))
#define LEDC_LSTIMER2_PARA_UP_V 0x1
#define LEDC_LSTIMER2_PARA_UP_S 25
/* LEDC_TICK_SEL_LSTIMER2 : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define LEDC_TICK_SEL_LSTIMER2 (BIT(24))
#define LEDC_TICK_SEL_LSTIMER2_M (BIT(24))
#define LEDC_TICK_SEL_LSTIMER2_V 0x1
#define LEDC_TICK_SEL_LSTIMER2_S 24
/* LEDC_LSTIMER2_RST : R/W ;bitpos:[23] ;default: 1'b1 ; */
/*description: */
#define LEDC_LSTIMER2_RST (BIT(23))
#define LEDC_LSTIMER2_RST_M (BIT(23))
#define LEDC_LSTIMER2_RST_V 0x1
#define LEDC_LSTIMER2_RST_S 23
/* LEDC_LSTIMER2_PAUSE : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER2_PAUSE (BIT(22))
#define LEDC_LSTIMER2_PAUSE_M (BIT(22))
#define LEDC_LSTIMER2_PAUSE_V 0x1
#define LEDC_LSTIMER2_PAUSE_S 22
/* LEDC_CLK_DIV_LSTIMER2 : R/W ;bitpos:[21:4] ;default: 18'h0 ; */
/*description: */
#define LEDC_CLK_DIV_LSTIMER2 0x0003FFFF
#define LEDC_CLK_DIV_LSTIMER2_M ((LEDC_CLK_DIV_LSTIMER2_V) << (LEDC_CLK_DIV_LSTIMER2_S))
#define LEDC_CLK_DIV_LSTIMER2_V 0x3FFFF
#define LEDC_CLK_DIV_LSTIMER2_S 4
/* LEDC_LSTIMER2_DUTY_RES : R/W ;bitpos:[3:0] ;default: 4'h0 ; */
/*description: */
#define LEDC_LSTIMER2_DUTY_RES 0x0000000F
#define LEDC_LSTIMER2_DUTY_RES_M ((LEDC_LSTIMER2_DUTY_RES_V) << (LEDC_LSTIMER2_DUTY_RES_S))
#define LEDC_LSTIMER2_DUTY_RES_V 0xF
#define LEDC_LSTIMER2_DUTY_RES_S 0

#define LEDC_LSTIMER2_VALUE_REG (DR_REG_LEDC_BASE + 0x00b4)
/* LEDC_LSTIMER2_CNT : RO ;bitpos:[13:0] ;default: 14'b0 ; */
/*description: */
#define LEDC_LSTIMER2_CNT 0x00003FFF
#define LEDC_LSTIMER2_CNT_M ((LEDC_LSTIMER2_CNT_V) << (LEDC_LSTIMER2_CNT_S))
#define LEDC_LSTIMER2_CNT_V 0x3FFF
#define LEDC_LSTIMER2_CNT_S 0

#define LEDC_LSTIMER3_CONF_REG (DR_REG_LEDC_BASE + 0x00b8)
/* LEDC_LSTIMER3_PARA_UP : WO ;bitpos:[25] ;default: 1'h0 ; */
/*description: */
#define LEDC_LSTIMER3_PARA_UP (BIT(25))
#define LEDC_LSTIMER3_PARA_UP_M (BIT(25))
#define LEDC_LSTIMER3_PARA_UP_V 0x1
#define LEDC_LSTIMER3_PARA_UP_S 25
/* LEDC_TICK_SEL_LSTIMER3 : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define LEDC_TICK_SEL_LSTIMER3 (BIT(24))
#define LEDC_TICK_SEL_LSTIMER3_M (BIT(24))
#define LEDC_TICK_SEL_LSTIMER3_V 0x1
#define LEDC_TICK_SEL_LSTIMER3_S 24
/* LEDC_LSTIMER3_RST : R/W ;bitpos:[23] ;default: 1'b1 ; */
/*description: */
#define LEDC_LSTIMER3_RST (BIT(23))
#define LEDC_LSTIMER3_RST_M (BIT(23))
#define LEDC_LSTIMER3_RST_V 0x1
#define LEDC_LSTIMER3_RST_S 23
/* LEDC_LSTIMER3_PAUSE : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER3_PAUSE (BIT(22))
#define LEDC_LSTIMER3_PAUSE_M (BIT(22))
#define LEDC_LSTIMER3_PAUSE_V 0x1
#define LEDC_LSTIMER3_PAUSE_S 22
/* LEDC_CLK_DIV_LSTIMER3 : R/W ;bitpos:[21:4] ;default: 18'h0 ; */
/*description: */
#define LEDC_CLK_DIV_LSTIMER3 0x0003FFFF
#define LEDC_CLK_DIV_LSTIMER3_M ((LEDC_CLK_DIV_LSTIMER3_V) << (LEDC_CLK_DIV_LSTIMER3_S))
#define LEDC_CLK_DIV_LSTIMER3_V 0x3FFFF
#define LEDC_CLK_DIV_LSTIMER3_S 4
/* LEDC_LSTIMER3_DUTY_RES : R/W ;bitpos:[3:0] ;default: 4'h0 ; */
/*description: */
#define LEDC_LSTIMER3_DUTY_RES 0x0000000F
#define LEDC_LSTIMER3_DUTY_RES_M ((LEDC_LSTIMER3_DUTY_RES_V) << (LEDC_LSTIMER3_DUTY_RES_S))
#define LEDC_LSTIMER3_DUTY_RES_V 0xF
#define LEDC_LSTIMER3_DUTY_RES_S 0

#define LEDC_LSTIMER3_VALUE_REG (DR_REG_LEDC_BASE + 0x00bC)
/* LEDC_LSTIMER3_CNT : RO ;bitpos:[13:0] ;default: 14'b0 ; */
/*description: */
#define LEDC_LSTIMER3_CNT 0x00003FFF
#define LEDC_LSTIMER3_CNT_M ((LEDC_LSTIMER3_CNT_V) << (LEDC_LSTIMER3_CNT_S))
#define LEDC_LSTIMER3_CNT_V 0x3FFF
#define LEDC_LSTIMER3_CNT_S 0

#define LEDC_INT_RAW_REG (DR_REG_LEDC_BASE + 0x00c0)
/* LEDC_OVF_CNT_LSCH7_INT_RAW : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH7_INT_RAW (BIT(19))
#define LEDC_OVF_CNT_LSCH7_INT_RAW_M (BIT(19))
#define LEDC_OVF_CNT_LSCH7_INT_RAW_V 0x1
#define LEDC_OVF_CNT_LSCH7_INT_RAW_S 19
/* LEDC_OVF_CNT_LSCH6_INT_RAW : RO ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH6_INT_RAW (BIT(18))
#define LEDC_OVF_CNT_LSCH6_INT_RAW_M (BIT(18))
#define LEDC_OVF_CNT_LSCH6_INT_RAW_V 0x1
#define LEDC_OVF_CNT_LSCH6_INT_RAW_S 18
/* LEDC_OVF_CNT_LSCH5_INT_RAW : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH5_INT_RAW (BIT(17))
#define LEDC_OVF_CNT_LSCH5_INT_RAW_M (BIT(17))
#define LEDC_OVF_CNT_LSCH5_INT_RAW_V 0x1
#define LEDC_OVF_CNT_LSCH5_INT_RAW_S 17
/* LEDC_OVF_CNT_LSCH4_INT_RAW : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH4_INT_RAW (BIT(16))
#define LEDC_OVF_CNT_LSCH4_INT_RAW_M (BIT(16))
#define LEDC_OVF_CNT_LSCH4_INT_RAW_V 0x1
#define LEDC_OVF_CNT_LSCH4_INT_RAW_S 16
/* LEDC_OVF_CNT_LSCH3_INT_RAW : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH3_INT_RAW (BIT(15))
#define LEDC_OVF_CNT_LSCH3_INT_RAW_M (BIT(15))
#define LEDC_OVF_CNT_LSCH3_INT_RAW_V 0x1
#define LEDC_OVF_CNT_LSCH3_INT_RAW_S 15
/* LEDC_OVF_CNT_LSCH2_INT_RAW : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH2_INT_RAW (BIT(14))
#define LEDC_OVF_CNT_LSCH2_INT_RAW_M (BIT(14))
#define LEDC_OVF_CNT_LSCH2_INT_RAW_V 0x1
#define LEDC_OVF_CNT_LSCH2_INT_RAW_S 14
/* LEDC_OVF_CNT_LSCH1_INT_RAW : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH1_INT_RAW (BIT(13))
#define LEDC_OVF_CNT_LSCH1_INT_RAW_M (BIT(13))
#define LEDC_OVF_CNT_LSCH1_INT_RAW_V 0x1
#define LEDC_OVF_CNT_LSCH1_INT_RAW_S 13
/* LEDC_OVF_CNT_LSCH0_INT_RAW : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH0_INT_RAW (BIT(12))
#define LEDC_OVF_CNT_LSCH0_INT_RAW_M (BIT(12))
#define LEDC_OVF_CNT_LSCH0_INT_RAW_V 0x1
#define LEDC_OVF_CNT_LSCH0_INT_RAW_S 12
/* LEDC_DUTY_CHNG_END_LSCH7_INT_RAW : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH7_INT_RAW (BIT(11))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_RAW_M (BIT(11))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_RAW_V 0x1
#define LEDC_DUTY_CHNG_END_LSCH7_INT_RAW_S 11
/* LEDC_DUTY_CHNG_END_LSCH6_INT_RAW : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH6_INT_RAW (BIT(10))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_RAW_M (BIT(10))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_RAW_V 0x1
#define LEDC_DUTY_CHNG_END_LSCH6_INT_RAW_S 10
/* LEDC_DUTY_CHNG_END_LSCH5_INT_RAW : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH5_INT_RAW (BIT(9))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_RAW_M (BIT(9))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_RAW_V 0x1
#define LEDC_DUTY_CHNG_END_LSCH5_INT_RAW_S 9
/* LEDC_DUTY_CHNG_END_LSCH4_INT_RAW : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH4_INT_RAW (BIT(8))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_RAW_M (BIT(8))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_RAW_V 0x1
#define LEDC_DUTY_CHNG_END_LSCH4_INT_RAW_S 8
/* LEDC_DUTY_CHNG_END_LSCH3_INT_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH3_INT_RAW (BIT(7))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_RAW_M (BIT(7))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_RAW_V 0x1
#define LEDC_DUTY_CHNG_END_LSCH3_INT_RAW_S 7
/* LEDC_DUTY_CHNG_END_LSCH2_INT_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH2_INT_RAW (BIT(6))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_RAW_M (BIT(6))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_RAW_V 0x1
#define LEDC_DUTY_CHNG_END_LSCH2_INT_RAW_S 6
/* LEDC_DUTY_CHNG_END_LSCH1_INT_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH1_INT_RAW (BIT(5))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_RAW_M (BIT(5))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_RAW_V 0x1
#define LEDC_DUTY_CHNG_END_LSCH1_INT_RAW_S 5
/* LEDC_DUTY_CHNG_END_LSCH0_INT_RAW : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define LEDC_DUTY_CHNG_END_LSCH0_INT_RAW (BIT(4))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_RAW_M (BIT(4))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_RAW_V 0x1
#define LEDC_DUTY_CHNG_END_LSCH0_INT_RAW_S 4
/* LEDC_LSTIMER3_OVF_INT_RAW : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER3_OVF_INT_RAW (BIT(3))
#define LEDC_LSTIMER3_OVF_INT_RAW_M (BIT(3))
#define LEDC_LSTIMER3_OVF_INT_RAW_V 0x1
#define LEDC_LSTIMER3_OVF_INT_RAW_S 3
/* LEDC_LSTIMER2_OVF_INT_RAW : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER2_OVF_INT_RAW (BIT(2))
#define LEDC_LSTIMER2_OVF_INT_RAW_M (BIT(2))
#define LEDC_LSTIMER2_OVF_INT_RAW_V 0x1
#define LEDC_LSTIMER2_OVF_INT_RAW_S 2
/* LEDC_LSTIMER1_OVF_INT_RAW : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER1_OVF_INT_RAW (BIT(1))
#define LEDC_LSTIMER1_OVF_INT_RAW_M (BIT(1))
#define LEDC_LSTIMER1_OVF_INT_RAW_V 0x1
#define LEDC_LSTIMER1_OVF_INT_RAW_S 1
/* LEDC_LSTIMER0_OVF_INT_RAW : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define LEDC_LSTIMER0_OVF_INT_RAW (BIT(0))
#define LEDC_LSTIMER0_OVF_INT_RAW_M (BIT(0))
#define LEDC_LSTIMER0_OVF_INT_RAW_V 0x1
#define LEDC_LSTIMER0_OVF_INT_RAW_S 0

